app/views/favorites/index.html.erb


      <% current_user.favorites.each do |favorite| %>
---
SELECT "favorites".* FROM "favorites"