app/helpers/sessions_helper.rb

SELECT  "commuters".* FROM "commuters" WHERE "commuters"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def current_user
    if @commuter.nil?
      @commuter = Commuter.find_by(id: session[:commuter_id])