app/controllers/commuters_controller.rb

SELECT  "commuters".* FROM "commuters" WHERE "commuters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @commuter = Commuter.find(params[:id])