app/controllers/favorites_controller.rb

  def index
    @favorites = Favorite.all
---
SELECT "favorites".* FROM "favorites"

  def new
    @favorite = Favorite.new
    # to be seen in new.html.erb
    @commuters = Commuter.all
---
SELECT "commuters".* FROM "commuters"

  def create
    @favorite = Favorite.new(favorite_params)
    @commuters = Commuter.all
    respond_to do |format|
      if @favorite.save
---
SELECT "commuters".* FROM "commuters"
INSERT INTO "favorites" ("name", "created_at", "updated_at", "commuter_id") VALUES (?, ?, ?, ?)  [["name", "sean's route valenzuela to makati"], ["created_at", "2019-02-08 06:17:10.929542"], ["updated_at", "2019-02-08 06:17:10.929542"], ["commuter_id", 1]]

  def destroy
    @favorite.destroy
---
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]

  def addition
    @favorite = Favorite.find(params[:id])
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_favorite
      @favorite = Favorite.find(params[:id])
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]