app/controllers/sessions_controller.rb

  def create
    commuter = Commuter.find_by(email: params[:session][:email])
---
SELECT  "commuters".* FROM "commuters" WHERE "commuters"."email" = ? LIMIT ?  [["email", "sean@gmail.com"], ["LIMIT", 1]]