app/controllers/transit_lines_controller.rb

    def set_transit_line
      @transit_line = TransitLine.find(params[:id])
---
SELECT  "transit_lines".* FROM "transit_lines" WHERE "transit_lines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]