app/controllers/transit_lines_controller.rb

  def index
    @transit_lines = TransitLine.all
---
SELECT "transit_lines".* FROM "transit_lines"

  def destroy
    @transit_line.destroy
---
DELETE FROM "favorites_transit_lines" WHERE "favorites_transit_lines"."transit_line_id" = ?  [["transit_line_id", 1]]
DELETE FROM "transit_lines" WHERE "transit_lines"."id" = ?  [["id", 1]]

    def set_transit_line
      @transit_line = TransitLine.find(params[:id])
---
SELECT  "transit_lines".* FROM "transit_lines" WHERE "transit_lines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]